{
    "title": "Restrictions",
    "description": "Use this section to define restrictions settings",
    "__preferencedomain": "com.apple.applicationaccess",
    "properties": {
        "allowAirPlayIncomingRequests": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', disables incoming AirPlay requests. Requires a supervised device. Available in macOS 12.3 and later, and tvOS 10.2 and later.\n{\"introduced\": \"12.3\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"10.2\", \"supervised\": true}"
        },
        "allowAutomaticScreenSaver": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', disables Apple TV's automatic screen saver. Available in tvOS 15.4 and later.\n{\"introduced\": \"15.4\", \"supervised\": true}"
        },
        "allowBookstoreErotica": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', the user can't download Apple Books media that is tagged as erotica. Available in iOS 6 and later, and tvOS 11.3 and later.\n{\"introduced\": \"6.0\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.3\"}"
        },
        "allowDeviceNameModification": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', prevents the user from changing the device name. Requires a supervised device. Available in iOS 9 and later, and tvOS 11.0 and later.\n{\"introduced\": \"9.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.0\", \"supervised\": true}"
        },
        "allowDeviceSleep": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', prevents device from automatically sleeping. Requires a supervised device. Available in tvOS 13 and later.\n{\"introduced\": \"13.0\", \"supervised\": true}"
        },
        "allowExplicitContent": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', hides explicit music or video content purchased from the iTunes Store. Explicit content is marked as such by content providers, such as record labels, when sold through the iTunes Store. As of iOS 13, requires a supervised device. Available in iOS 4 and later, and tvOS 11.3 and later.\n{\"introduced\": \"4.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.3\"}"
        },
        "allowListedAppBundleIDs": {
            "type": "array",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array"
                }
            ],
            "description": "If present, this property allows only bundle IDs listed in the array to be shown or launchable. Include the value 'com.apple.webapp' to allow all webclips. Requires a supervised device. Available in iOS 9.3 and later, and tvOS 11.0 and later.\n{\"introduced\": \"15.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"15.0\", \"supervised\": true}"
        },
        "allowPasswordProximityRequests": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', disables requesting passwords from nearby devices. Requires a supervised device. Available in iOS 12 and later, macOS 10.14 and later, and tvOS 12 and later.\n{\"introduced\": \"10.14\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"12.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"12.0\", \"supervised\": true}"
        },
        "allowRemoteAppPairing": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": true
                }
            ],
            "default": true,
            "description": "If 'false', disables pairing Apple TV for use with the Remote app or Control Center widget. Requires a supervised device. Available in tvOS 10.2 and later.\n{\"introduced\": \"10.2\", \"supervised\": true}"
        },
        "blacklistedAppBundleIDs": {
            "type": "array",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array"
                }
            ],
            "description": "Use blockedAppBundleIDs instead.\n{\"introduced\": \"9.3\", \"deprecated\": \"15.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.0\", \"deprecated\": \"15.0\", \"supervised\": true}"
        },
        "blockedAppBundleIDs": {
            "type": "array",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array"
                }
            ],
            "description": "If present, prevents bundle IDs listed in the array from being shown or launchable. Include the value 'com.apple.webapp' to restrict all webclips. Note that denying system apps may disable other functionality. For example, denying the App Store app may prevent users from accepting the terms and conditions for user-based VPP.\nRequires a supervised device. Available in iOS 9.3 and later, and tvOS 11.0 and later.\n{\"introduced\": \"15.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"15.0\", \"supervised\": true}"
        },
        "enforcedSoftwareUpdateDelay": {
            "type": "integer",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "default": 30,
                    "pattern": "[1-90]"
                }
            ],
            "default": 30,
            "description": "Sets how many days to delay a software update on the device. With this restriction in place, the user doesn't see a software update until the specified number of days after the software update release date. This value is used by 'forceDelayedAppSoftwareUpdates' and 'forceDelayedSoftwareUpdates'.\nRequires a supervised device in iOS and tvOS.\nAvailable in iOS 11.3 and later, macOS 10.13.4 and later, and tvOS 12.2 and later.\n{\"introduced\": \"10.13.4\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.3\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"12.2\", \"supervised\": true}"
        },
        "forceAirPlayIncomingRequestsPairingPassword": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": false
                }
            ],
            "default": false,
            "description": "If 'true', forces all devices sending AirPlay requests to this device to use a pairing password. Available in Apple TV Software 6.2 and later. This key isn't supported in tvOS 10.2 and later. Use the AirPlay Security Payload instead.\n{\"introduced\": \"6.2\"}"
        },
        "forceAutomaticDateAndTime": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": false
                }
            ],
            "default": false,
            "description": "If 'true', enables the Set Automatically feature in Date & Time and can't be disabled by the user.  The device's time zone is updated only when the device can determine its location using a cellular connection or Wi-Fi with location services enabled. Requires a supervised device. Available in iOS 12 and later, and tvOS 12.2 and later.\n{\"introduced\": \"12.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"12.2\", \"supervised\": true}"
        },
        "forceDelayedSoftwareUpdates": {
            "type": "boolean",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean",
                    "default": false
                }
            ],
            "default": false,
            "description": "If 'true', delays user visibility of software updates. In macOS, seed build updates are allowed, without delay. Requires a supervised device in iOS and tvOS.\nThe delay is 30 days unless 'enforcedSoftwareUpdateDelay' is set to another value.\nAvailable in iOS 11.3 and later, macOS 10.13 and later, and tvOS 12.2 and later.\n{\"introduced\": \"10.13\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.3\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"12.2\", \"supervised\": true}"
        },
        "ratingApps": {
            "type": "integer",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "default": 1000
                }
            ],
            "default": 1000,
            "description": "The maximum level of app content allowed on the device. Available in iOS 4 and later, and tvOS 11.3 and later.\nPossible values (with the US description of the rating level):\n* 1000: All\n* 600: 17+\n* 300: 12+\n* 200: 9+\n* 100: 4+\n* 0: None\n{\"introduced\": \"4.0\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.3\"}"
        },
        "ratingMovies": {
            "type": "integer",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "default": 1000
                }
            ],
            "default": 1000,
            "description": "The maximum level of movie content allowed on the device. Available in iOS 4 and later, and tvOS 11.3 and later.\nPossible values (with the US description of the rating level):\n* 1000: All\n* 500: NC-17\n* 400: R\n* 300: PG-13\n* 200: PG\n* 100: G\n* 0: None\n{\"introduced\": \"4.0\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.3\"}"
        },
        "ratingRegion": {
            "type": "string",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string"
                }
            ],
            "description": "The two-letter key that profile tools use to display the proper ratings for the given region. This data isn't recognized or reported by the client."
        },
        "ratingTVShows": {
            "type": "integer",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "integer",
                    "default": 1000
                }
            ],
            "default": 1000,
            "description": "The maximum level of TV content allowed on the device. Available in iOS 4 and later, and tvOS 11.3 and later.\n\nPossible values (with the US description of the rating level):\n\n* 1000: All\n* 600: TV-MA\n* 500: TV-14\n* 400: TV-PG\n* 300: TV-G\n* 200: TV-Y7\n* 100: TV-Y\n* 0: None\n{\"introduced\": \"4.0\", \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.3\"}"
        },
        "whitelistedAppBundleIDs": {
            "type": "array",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "array"
                }
            ],
            "description": "Use 'allowListedAppBundleIDs' instead.\n{\"introduced\": \"9.3\", \"deprecated\": \"15.0\", \"supervised\": true, \"userenrollment\": {\"mode\": \"forbidden\"}}\n{\"introduced\": \"11.0\", \"deprecated\": \"15.0\", \"supervised\": true}"
        }
    }
}